app/Controllers/AreasController.php

SELECT *
FROM `areas`
WHERE `areas`.`deleted_at` IS NULL
---
    public function index()
    {
        if (auth()->loggedIn()) {
            $areas_model = new AreasModel();
            $data['areas'] = $areas_model->findAll();

INSERT INTO `areas` (`areas_name`, `created_at`, `updated_at`) VALUES ('area', '2023-09-06 12:20:03', '2023-09-06 12:20:03')
---
    public function store_areas()
    {

        $areas_model = new AreasModel();
        $data = [
            'areas_name' => $this->request->getVar('areas_name'),
            'created_at'  => $this->request->getVar('created_at'),
        ];
        // print_r($data) ;
        // die();
        $areas_model->insert($data);