app/Controllers/Areas.php

SELECT *
FROM `areas`
---
    public function index()
    {
        if (auth()->loggedIn()) {
            $areas_model = new AreasModel();
            $data['areas'] = $areas_model->findAll();