app/Controllers/CustomersController.php

SELECT *
FROM `customer`
JOIN `area` ON `customer`.`area_id` = `area`.`area_id`
---
    public function index()
    {
        $customers_model = new CustomersModel();
        $data['customers'] = $customers_model
            ->join('area', 'customer.area_id = area.area_id')->findAll();