app/Controllers/ProductsController.php

       public function index(){

        if (auth()->loggedIn()) {
              $product_model = new ProductsModel();
              $data['products'] = $product_model->findAll();
---
SELECT *
FROM `products`

    public function store_products()
    {
       $product_model = new ProductsModel();
        $data = [
            'product_name' => $this->request->getPost('product_name'),
            'product_category' => $this->request->getPost('product_category'),
            'weight' => $this->request->getPost('product_weight'),
            'unit' => $this->request->getPost('product_unit'),
            'selling_price_including_tax' => $this->request->getPost('selling_price_including_tax'),
            'tax_amount' => $this->request->getPost('product_tax_amount'),
        ];
        print_r($data);
        $product_model->save($data);
---
INSERT INTO `products` (`product_name`, `product_category`, `weight`, `unit`, `selling_price_including_tax`, `tax_amount`) VALUES ('yogurt', 'Regular', '1', 'litre', '50', '10')

    public function delete_product($id){
        $product_model = new ProductsModel();
            $product_model->delete($id);
---
DELETE FROM `products`
WHERE `product_id` IN ('26')

    public function edit_product($id){
        $product_model = new ProductsModel();
        $data['products'] = $product_model->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`product_id` = '25'